euyju/VibeClean/HW/STM32/Core/Src/main.c
  // S2: PC1 (TRIG), PA15 (ECHO)
  GPIO_InitStruct.Pin = TRIG_PIN1; // PC1
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
  HAL_GPIO_Init(TRIG_PORT1, &GPIO_InitStruct);

  GPIO_InitStruct.Pin = ECHO_PIN1; // PA15
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(ECHO_PORT1, &GPIO_InitStruct);


  /* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */

/**
  * @brief  TIM6 인터럽트 콜백 - Edge-AI 100Hz 데이터 수집
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
    if (htim->Instance == TIM6) {
        if (!edge_ai_buffer_ready) {
            float ax, ay, az;

            // MPU6050에서 가속도 읽기
            if (MPU6050_ReadAccel(&hi2c1, &ax, &ay, &az) == HAL_OK) {
                // 버퍼에 저장
                edge_ai_buffer[edge_ai_sample_index * 3 + 0] = ax;
                edge_ai_buffer[edge_ai_sample_index * 3 + 1] = ay;
                edge_ai_buffer[edge_ai_sample_index * 3 + 2] = az;

                edge_ai_sample_index++;

                // 버퍼가 가득 찼으면 플래그 설정
                if (edge_ai_sample_index >= EDGE_AI_SAMPLE_COUNT) {
                    edge_ai_buffer_ready = 1;
                    edge_ai_sample_index = 0;
                }
            }
        }
    }
}

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
